app/views/students/_form.html.erb

            <label for="country">Country</label>
            <%=f.collection_select :country_id, Country.all, :id, :name,{},{:class=> "form-control",:onChange=>"getState(this.value)"}  %>
---
SELECT  `states`.* FROM `states`  ORDER BY `states`.`id` ASC LIMIT 1
SELECT `countries`.* FROM `countries`