app/views/students/register.html.erb

SELECT `cities`.* FROM `cities`  ORDER BY `cities`.`name` ASC
SELECT `states`.* FROM `states` WHERE `states`.`country_id` = 1
---
    console.log(val)
    $.ajax({
        type: "GET",
        url: "get_state",
        data: 'country_id=' + val,
        success: function(data) {
            console.log(data.states)
            var stateSelect = document.getElementById("state");
            stateSelect.innerHTML = "";
            var citySelect = document.getElementById("city");
            citySelect.innerHTML = "";
            for (var i = 0; i < data.states.length; i++) {
                var opt = document.createElement('option');
                opt.innerHTML = data.states[i].name;
                opt.setAttribute("value", data.states[i].id)
                stateSelect.appendChild(opt);

            }


        }
    });