app/views/home/index.html.erb

                    if (allCountries[i].id == clickedStudent.country_id) {
                        clickedStudent.country_id = allCountries[i].name;
---
SELECT `countries`.* FROM `countries`