app/controllers/home_controller.rb

    def index
    	 @students=Student.order(created_at: :desc).all
    	 @studentsJson=Student.order(created_at: :desc).all.to_json
    	 @countriesJson=Country.all.to_json
		 @statesJson=State.all.to_json
		 @citiesJson=City.all.to_json
---
SELECT `students`.* FROM `students`  ORDER BY `students`.`created_at` DESC
SELECT `countries`.* FROM `countries`
SELECT `students`.* FROM `students` WHERE (name like '%har%')
SELECT `states`.* FROM `states`
SELECT `cities`.* FROM `cities`

    def exportCSV
    	@csv_data=Student.all
---
SELECT  `students`.* FROM `students`  ORDER BY `students`.`id` ASC LIMIT 1

    def exportCSV2
    	@csv2_data = Student.all
		csv_string = CSV.generate do |csv|
			csv << ["id","name","dob","email","Country","State","City","course"]
				@csv2_data.each do |me|
					csv << [me.id, me.name, me.dob,me.email,me.country.name,me.state.name,me.city.name,me.city.name,me.course]
---
SELECT `students`.* FROM `students`
SELECT  `states`.* FROM `states` WHERE `states`.`id` = 2 LIMIT 1

	def download_PDF
		@studentsPDF=Student.all
---
SELECT `students`.* FROM `students`