app/controllers/students_controller.rb

  def index
    @xls_data = Student.all
---
SELECT `students`.* FROM `students`

  def create
    begin
      Student.create(student_params)
---
INSERT INTO `students` (`name`, `dob`, `email`, `phone`, `country_id`, `state_id`, `city_id`, `course`, `youtubeID`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('Deepak Jassi', '2017-11-08', 'deepak.jassi@nagarro.com', 234, 1, 2, 3, 'Maths', 'Oka69aDkBV4', 'abc.jpeg', 'image/jpeg', 724005, '2017-11-03 10:51:35', '2017-11-03 10:51:36', '2017-11-03 10:51:36')

  def register
    @student=Student.new
    @create=true
    @countries = Country.all
---
SELECT `countries`.* FROM `countries`

  def update
    @student=Student.find(params[:id])
    @student.update(student_params)
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 22 LIMIT 1
UPDATE `students` SET `name` = 'Manoj12', `country_id` = 1, `state_id` = 2, `city_id` = 3, `updated_at` = '2017-11-02 04:33:16' WHERE `students`.`id` = 22

  def edit
    @countries = Country.all
    @student=Student.find(params[:id])
---
SELECT `countries`.* FROM `countries`
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 19 LIMIT 1

  def destroy
    Student.delete(params[:id])
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 5]]

  def get_state

    @states = State.where(country_id:params[:country_id])
---
SELECT `states`.* FROM `states` WHERE `states`.`country_id` = 1

  def get_city

    @cities = City.where(state_id:params[:state_id])
---
SELECT `cities`.* FROM `cities` WHERE `cities`.`state_id` = 2